tap "homebrew/cask-fonts"
tap "homebrew/cask"

brew "coreutils"
brew "gnu-sed"
brew "bash"                      # Use latest bash
brew "bash-completion"
brew "git"
brew "gh"                        # Replacement to hub
brew "vim"                       # Don't use native vim
brew "tmux"
brew "reattach-to-user-namespace" # Required to fix macos copy/paste in tmux
brew "gpg"
brew "bat"                       # cat with syntax highlighting
brew "fd"                        # simpler version of find
brew "fzf"                       # fuzzy finder for bash and (neo)vim
brew "lf"                        # terminal file manager
brew "exa"                       # Better ls
brew "tldr"                      # community managed man pages
brew "ripgrep"                   # Faster grep
brew "less"                      # Use latest less
brew "git-delta"                 # Better git pager
brew "starship"                  # Terminal prompt

cask "1password"                 # Password manager
cask "firefox"                   # The ONE web browser to rule them all
cask "iterm2"                    # Replacement terminal app
cask "qlmarkdown"                # Quickview markdown files
cask "docker"

mas "Xcode", id: 497799835
mas "1Password 7 - Password Manager", id: 1333542190
mas "Hush Nag Blocker", id: 1544743900
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "NextDNS", id: 1464122853
mas "PiPifier - PiP for nearly every video", id: 1160374471
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Noir - Dark Mode for Safari", id: 1592917505
mas "1Password for Safari", id: 1569813296
