tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "spotify/public"

brew "coreutils"
brew "gnu-sed"
brew "bash"                      # Use latest bash
brew "bash-completion"
brew "git"
brew "hub"                       # Enhance git
brew "vim"                       # Don't use native vim
brew "neovim"
brew "tmux"
brew "reattach-to-user-namespace" # Required to fix macos copy/paste in tmux
brew "gpg"
brew "bat"                       # cat with syntax highlighting
brew "fd"                        # simpler version of find
brew "fzf"                       # fuzzy finder for bash and (neo)vim
brew "tldr"                      # community managed man pages
brew "ripgrep"                   # Faster grep
brew "direnv"                    # Project specific ENV vars

cask "firefox"                   # The ONE web browser to rule them all
cask "vlc"                       # The ONE media player to rule them all
cask "iterm2"                    # Replacement terminal app
cask "numi"                      # A better calculator
cask "qlmarkdown"                # Quickview markdown files
cask "aws-vault"                 # macOS Keychain wrapper for AWS API
cask "spotify"                   # Current music player service
cask "signal"                    # e2e multi-device/platform chat
cask "docker"
cask "flux"                      # A better "Night Shift™️"
cask "steam"                     # Steam client
cask "itch"                      # itch.io client

mas "Xcode", id: 497799835
mas "1Password", id: 443987910
mas "NextDNS", id: 1464122853
mas "PiPifier - PiP for nearly every video", id: 1160374471
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
