tap "caskroom/fonts"
tap "caskroom/cask"

brew "bash"                      # Use latest bash
brew "git"
brew "hub"                       # Enhance git
brew "vim"                       # Don't use native vim
brew "neovim/neovim/neovim"
brew "yarn"

cask "firefox"
cask "thunderbird"
cask "vlc"
cask "bittorrent"
cask "font-sauce-code-powerline" # Use this font in terminal
cask "iterm2"
cask "numi"                      # A better calculator
cask "qlmarkdown"                # Quickview markdown files
cask "veertu-desktop"            # VM manager which uses OSX's hypervisor

mas "Xcode", id: 497799835
mas "1Password", id: 443987910
